/*
 * Copyright (c) 2018-2026 CTCaer
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms and conditions of the GNU General Public License,
 * version 2, as published by the Free Software Foundation.
 *
 * This program is distributed in the hope it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 * more details.
 */

#ifndef _PMC_T210_H_
#define _PMC_T210_H_

#include "types.h"

typedef struct _pmc_regs_t210_t  {
/* 0x000 */	u32 pmc_cntrl;
/* 0x004 */	u32 pmc_sec_disable;
/* 0x008 */	u32 pmc_pmc_swrst;
/* 0x00c */	u32 pmc_wake_mask;
/* 0x010 */	u32 pmc_wake_lvl;
/* 0x014 */	u32 pmc_wake_status;
/* 0x018 */	u32 pmc_sw_wake_status;
/* 0x01c */	u32 pmc_dpd_pads_oride;
/* 0x020 */	u32 pmc_dpd_sample;
/* 0x024 */	u32 pmc_dpd_enable;
/* 0x028 */	u32 pmc_pwrgate_timer_off;
/* 0x02c */	u32 pmc_clamp_status;
/* 0x030 */	u32 pmc_pwrgate_toggle;
/* 0x034 */	u32 pmc_remove_clamping_cmd;
/* 0x038 */	u32 pmc_pwrgate_status;
/* 0x03c */	u32 pmc_pwrgood_timer;
/* 0x040 */	u32 pmc_blink_timer;
/* 0x044 */	u32 pmc_no_iopower;
/* 0x048 */	u32 pmc_pwr_det;
/* 0x04c */	u32 pmc_pwr_det_latch;
/* 0x050 */	u32 pmc_scratch0;
/* 0x054 */	u32 pmc_scratch1;
/* 0x058 */	u32 pmc_scratch2;
/* 0x05c */	u32 pmc_scratch3;
/* 0x060 */	u32 pmc_scratch4;
/* 0x064 */	u32 pmc_scratch5;
/* 0x068 */	u32 pmc_scratch6;
/* 0x06c */	u32 pmc_scratch7;
/* 0x070 */	u32 pmc_scratch8;
/* 0x074 */	u32 pmc_scratch9;
/* 0x078 */	u32 pmc_scratch10;
/* 0x07c */	u32 pmc_scratch11;
/* 0x080 */	u32 pmc_scratch12;
/* 0x084 */	u32 pmc_scratch13;
/* 0x088 */	u32 pmc_scratch14;
/* 0x08c */	u32 pmc_scratch15;
/* 0x090 */	u32 pmc_scratch16;
/* 0x094 */	u32 pmc_scratch17;
/* 0x098 */	u32 pmc_scratch18;
/* 0x09c */	u32 pmc_scratch19;
/* 0x0a0 */	u32 pmc_scratch20; // ODM data/config scratch.
/* 0x0a4 */	u32 pmc_scratch21;
/* 0x0a8 */	u32 pmc_scratch22;
/* 0x0ac */	u32 pmc_scratch23;
/* 0x0b0 */	u32 pmc_secure_scratch0;
/* 0x0b4 */	u32 pmc_secure_scratch1;
/* 0x0b8 */	u32 pmc_secure_scratch2;
/* 0x0bc */	u32 pmc_secure_scratch3;
/* 0x0c0 */	u32 pmc_secure_scratch4;
/* 0x0c4 */	u32 pmc_secure_scratch5;
/* 0x0c8 */	u32 pmc_cpupwrgood_timer;
/* 0x0cc */	u32 pmc_cpupwroff_timer;
/* 0x0d0 */	u32 pmc_pg_mask;
/* 0x0d4 */	u32 pmc_pg_mask_1;
/* 0x0d8 */	u32 pmc_auto_wake_lvl;
/* 0x0dc */	u32 pmc_auto_wake_lvl_mask;
/* 0x0e0 */	u32 pmc_wake_delay;
/* 0x0e4 */	u32 pmc_pwr_det_val;
/* 0x0e8 */	u32 pmc_ddr_pwr;
/* 0x0ec */	u32 pmc_usb_debounce_del;
/* 0x0f0 */	u32 pmc_usb_ao;
/* 0x0f4 */	u32 pmc_crypto_op;
/* 0x0f8 */	u32 pmc_pllp_wb0_override;
/* 0x0fc */	u32 pmc_scratch24;
/* 0x100 */	u32 pmc_scratch25;
/* 0x104 */	u32 pmc_scratch26;
/* 0x108 */	u32 pmc_scratch27;
/* 0x10c */	u32 pmc_scratch28;
/* 0x110 */	u32 pmc_scratch29;
/* 0x114 */	u32 pmc_scratch30;
/* 0x118 */	u32 pmc_scratch31;
/* 0x11c */	u32 pmc_scratch32;
/* 0x120 */	u32 pmc_scratch33;
/* 0x124 */	u32 pmc_scratch34;
/* 0x128 */	u32 pmc_scratch35;
/* 0x12c */	u32 pmc_scratch36;
/* 0x130 */	u32 pmc_scratch37;
/* 0x134 */	u32 pmc_scratch38;
/* 0x138 */	u32 pmc_scratch39;
/* 0x13c */	u32 pmc_scratch40;
/* 0x140 */	u32 pmc_scratch41;
/* 0x144 */	u32 pmc_scratch42;
/* 0x148 */	u32 pmc_bondout_mirror0;
/* 0x14c */	u32 pmc_bondout_mirror1;
/* 0x150 */	u32 pmc_bondout_mirror2;
/* 0x154 */	u32 pmc_sys_33v_en;
/* 0x158 */	u32 pmc_bondout_mirror_access;
/* 0x15c */	u32 pmc_gate;
/* 0x160 */	u32 pmc_wake2_mask;
/* 0x164 */	u32 pmc_wake2_lvl;
/* 0x168 */	u32 pmc_wake2_status;
/* 0x16c */	u32 pmc_sw_wake2_status;
/* 0x170 */	u32 pmc_auto_wake2_lvl_mask;
/* 0x174 */	u32 pmc_pg_mask_2;
/* 0x178 */	u32 pmc_pg_mask_ce1;
/* 0x17c */	u32 pmc_pg_mask_ce2;
/* 0x180 */	u32 pmc_pg_mask_ce3;
/* 0x184 */	u32 pmc_pwrgate_timer_ce_0;
/* 0x188 */	u32 pmc_pwrgate_timer_ce_1;
/* 0x18c */	u32 pmc_pwrgate_timer_ce_2;
/* 0x190 */	u32 pmc_pwrgate_timer_ce_3;
/* 0x194 */	u32 pmc_pwrgate_timer_ce_4;
/* 0x198 */	u32 pmc_pwrgate_timer_ce_5;
/* 0x19c */	u32 pmc_pwrgate_timer_ce_6;
/* 0x1a0 */	u32 pmc_pcx_edpd_cntrl;
/* 0x1a4 */	u32 pmc_osc_edpd_over;
/* 0x1a8 */	u32 pmc_clk_out_cntrl;
/* 0x1ac */	u32 pmc_sata_pwrgt;
/* 0x1b0 */	u32 pmc_sensor_ctrl;
/* 0x1b4 */	u32 pmc_rst_status;
/* 0x1b8 */	u32 pmc_io_dpd_req;
/* 0x1bc */	u32 pmc_io_dpd_status;
/* 0x1c0 */	u32 pmc_io_dpd2_req;
/* 0x1c4 */	u32 pmc_io_dpd2_status;
/* 0x1c8 */	u32 pmc_sel_dpd_tim;
/* 0x1cc */	u32 pmc_vddp_sel;
/* 0x1d0 */	u32 pmc_ddr_cfg;
/* 0x1d4 */	u32 pmc_e_no_vttgen;
/* 0x1d8 */	u32 rsvd_1d8;
/* 0x1dc */	u32 pmc_pllm_wb0_override_freq;
/* 0x1e0 */	u32 pmc_test_pwrgate;
/* 0x1e4 */	u32 pmc_pwrgate_timer_mult;
/* 0x1e8 */	u32 pmc_dsi_sel_dpd;
/* 0x1ec */	u32 pmc_utmip_uhsic_triggers;
/* 0x1f0 */	u32 pmc_utmip_uhsic_saved_state;
/* 0x1f4 */	u32 rsvd_1f4;
/* 0x1f8 */	u32 pmc_utmip_term_pad_cfg;
/* 0x1fc */	u32 pmc_utmip_uhsic_sleep_cfg;
/* 0x200 */	u32 pmc_utmip_uhsic_sleepwalk_cfg;
/* 0x204 */	u32 pmc_utmip_sleepwalk_p0;
/* 0x208 */	u32 pmc_utmip_sleepwalk_p1;
/* 0x20c */	u32 pmc_utmip_sleepwalk_p2;
/* 0x210 */	u32 pmc_uhsic_sleepwalk_p0;
/* 0x214 */	u32 pmc_utmip_uhsic_status;
/* 0x218 */	u32 pmc_utmip_uhsic_fake;
/* 0x21c */	u32 pmc_bondout_mirror3;
/* 0x220 */	u32 pmc_bondout_mirror4;
/* 0x224 */	u32 pmc_secure_scratch6;
/* 0x228 */	u32 pmc_secure_scratch7;
/* 0x22c */	u32 pmc_scratch43;
/* 0x230 */	u32 pmc_scratch44;
/* 0x234 */	u32 pmc_scratch45;
/* 0x238 */	u32 pmc_scratch46;
/* 0x23c */	u32 pmc_scratch47;
/* 0x240 */	u32 pmc_scratch48;
/* 0x244 */	u32 pmc_scratch49;
/* 0x248 */	u32 pmc_scratch50;
/* 0x24c */	u32 pmc_scratch51;
/* 0x250 */	u32 pmc_scratch52;
/* 0x254 */	u32 pmc_scratch53;
/* 0x258 */	u32 pmc_scratch54;
/* 0x25c */	u32 pmc_scratch55;
/* 0x260 */	u32 pmc_scratch0_eco;
/* 0x264 */	u32 pmc_por_dpd_ctrl;
/* 0x268 */	u32 pmc_scratch2_eco;
/* 0x26c */	u32 pmc_utmip_uhsic_line_wakeup;
/* 0x270 */	u32 pmc_utmip_bias_master_cntrl;
/* 0x274 */	u32 pmc_utmip_master_config;
/* 0x278 */	u32 pmc_td_pwrgate_inter_part_timer;
/* 0x27c */	u32 pmc_utmip_uhsic2_triggers;
/* 0x280 */	u32 pmc_utmip_uhsic2_saved_state;
/* 0x284 */	u32 pmc_utmip_uhsic2_sleep_cfg;
/* 0x288 */	u32 pmc_utmip_uhsic2_sleepwalk_cfg;
/* 0x28c */	u32 pmc_uhsic2_sleepwalk_p1;
/* 0x290 */	u32 pmc_utmip_uhsic2_status;
/* 0x294 */	u32 pmc_utmip_uhsic2_fake;
/* 0x298 */	u32 pmc_utmip_uhsic2_line_wakeup;
/* 0x29c */	u32 pmc_utmip_master2_config;
/* 0x2a0 */	u32 pmc_utmip_uhsic_rpd_cfg;
/* 0x2a4 */	u32 pmc_pg_mask_ce0;
/* 0x2a8 */	u32 pmc_pg_mask_3;
/* 0x2ac */	u32 pmc_pg_mask_4;
/* 0x2b0 */	u32 pmc_pllm_wb0_override2;
/* 0x2b4 */	u32 pmc_tsc_mult;
/* 0x2b8 */	u32 pmc_cpu_vsense_override;
/* 0x2bc */	u32 pmc_glb_amap_cfg;
/* 0x2c0 */	u32 pmc_sticky_bits;
/* 0x2c4 */	u32 pmc_sec_disable2;
/* 0x2c8 */	u32 pmc_weak_bias;
/* 0x2cc */	u32 pmc_reg_short;
/* 0x2d0 */	u32 pmc_pg_mask_andor;
/* 0x2d4 */	u32 pmc_gpu_rg_cntrl;
/* 0x2d8 */	u32 pmc_sec_disable3;
/* 0x2dc */	u32 pmc_pg_mask_5;
/* 0x2e0 */	u32 pmc_pg_mask_6;
/* 0x2e4 */	u32 rsvd_2e4[7];
/* 0x300 */	u32 pmc_secure_scratch8;
/* 0x304 */	u32 pmc_secure_scratch9;
/* 0x308 */	u32 pmc_secure_scratch10;
/* 0x30c */	u32 pmc_secure_scratch11;
/* 0x310 */	u32 pmc_secure_scratch12;
/* 0x314 */	u32 pmc_secure_scratch13;
/* 0x318 */	u32 pmc_secure_scratch14;
/* 0x31c */	u32 pmc_secure_scratch15;
/* 0x320 */	u32 pmc_secure_scratch16;
/* 0x324 */	u32 pmc_secure_scratch17;
/* 0x328 */	u32 pmc_secure_scratch18;
/* 0x32c */	u32 pmc_secure_scratch19;
/* 0x330 */	u32 pmc_secure_scratch20;
/* 0x334 */	u32 pmc_secure_scratch21;
/* 0x338 */	u32 pmc_secure_scratch22; // AArch32 reset address.
/* 0x33c */	u32 pmc_secure_scratch23;
/* 0x340 */	u32 pmc_secure_scratch24;
/* 0x344 */	u32 pmc_secure_scratch25;
/* 0x348 */	u32 pmc_secure_scratch26;
/* 0x34c */	u32 pmc_secure_scratch27;
/* 0x350 */	u32 pmc_secure_scratch28;
/* 0x354 */	u32 pmc_secure_scratch29;
/* 0x358 */	u32 pmc_secure_scratch30;
/* 0x35c */	u32 pmc_secure_scratch31;
/* 0x360 */	u32 pmc_secure_scratch32;
/* 0x364 */	u32 pmc_secure_scratch33;
/* 0x368 */	u32 pmc_secure_scratch34; // AArch64 reset address.
/* 0x36c */	u32 pmc_secure_scratch35; // AArch64 reset hi-address.
/* 0x370 */	u32 pmc_secure_scratch36;
/* 0x374 */	u32 pmc_secure_scratch37;
/* 0x378 */	u32 pmc_secure_scratch38;
/* 0x37c */	u32 pmc_secure_scratch39;
/* 0x380 */	u32 pmc_secure_scratch40;
/* 0x384 */	u32 pmc_secure_scratch41;
/* 0x388 */	u32 pmc_secure_scratch42;
/* 0x38c */	u32 pmc_secure_scratch43;
/* 0x390 */	u32 pmc_secure_scratch44;
/* 0x394 */	u32 pmc_secure_scratch45;
/* 0x398 */	u32 pmc_secure_scratch46;
/* 0x39c */	u32 pmc_secure_scratch47;
/* 0x3a0 */	u32 pmc_secure_scratch48;
/* 0x3a4 */	u32 pmc_secure_scratch49;
/* 0x3a8 */	u32 pmc_secure_scratch50;
/* 0x3ac */	u32 pmc_secure_scratch51;
/* 0x3b0 */	u32 pmc_secure_scratch52;
/* 0x3b4 */	u32 pmc_secure_scratch53;
/* 0x3b8 */	u32 pmc_secure_scratch54;
/* 0x3bc */	u32 pmc_secure_scratch55;
/* 0x3c0 */	u32 pmc_secure_scratch56;
/* 0x3c4 */	u32 pmc_secure_scratch57;
/* 0x3c8 */	u32 pmc_secure_scratch58;
/* 0x3cc */	u32 pmc_secure_scratch59;
/* 0x3d0 */	u32 pmc_secure_scratch60;
/* 0x3d4 */	u32 pmc_secure_scratch61;
/* 0x3d8 */	u32 pmc_secure_scratch62;
/* 0x3dc */	u32 pmc_secure_scratch63;
/* 0x3e0 */	u32 pmc_secure_scratch64;
/* 0x3e4 */	u32 pmc_secure_scratch65;
/* 0x3e8 */	u32 pmc_secure_scratch66;
/* 0x3ec */	u32 pmc_secure_scratch67;
/* 0x3f0 */	u32 pmc_secure_scratch68;
/* 0x3f4 */	u32 pmc_secure_scratch69;
/* 0x3f8 */	u32 pmc_secure_scratch70;
/* 0x3fc */	u32 pmc_secure_scratch71;
/* 0x400 */	u32 pmc_secure_scratch72;
/* 0x404 */	u32 pmc_secure_scratch73;
/* 0x408 */	u32 pmc_secure_scratch74;
/* 0x40c */	u32 pmc_secure_scratch75;
/* 0x410 */	u32 pmc_secure_scratch76;
/* 0x414 */	u32 pmc_secure_scratch77;
/* 0x418 */	u32 pmc_secure_scratch78;
/* 0x41c */	u32 pmc_secure_scratch79;
/* 0x420 */	u32 rsvd_420[8];
/* 0x440 */	u32 pmc_cntrl2;
/* 0x444 */	u32 pmc_io_dpd_off_mask;
/* 0x448 */	u32 pmc_io_dpd2_off_mask;
/* 0x44c */	u32 pmc_event_counter;
/* 0x450 */	u32 pmc_fuse_control;
/* 0x454 */	u32 pmc_scratch1_eco;
/* 0x458 */	u32 rsvd_458;
/* 0x45c */	u32 pmc_io_dpd3_req;
/* 0x460 */	u32 pmc_io_dpd3_status;
/* 0x464 */	u32 pmc_io_dpd4_req;
/* 0x468 */	u32 pmc_io_dpd4_status;
/* 0x46c */	u32 rsvd_46c[2];
/* 0x474 */	u32 pmc_direct_thermtrip_cfg;
/* 0x478 */	u32 pmc_tsosc_delay;
/* 0x47c */	u32 pmc_set_sw_clamp;
/* 0x480 */	u32 pmc_debug_authentication;
/* 0x484 */	u32 pmc_aotag_cfg;
/* 0x488 */	u32 pmc_aotag_thresh1_cfg;
/* 0x48c */	u32 pmc_aotag_thresh2_cfg;
/* 0x490 */	u32 pmc_aotag_thresh3_cfg;
/* 0x494 */	u32 pmc_aotag_status;
/* 0x498 */	u32 pmc_aotag_security;
/* 0x49c */	u32 pmc_tsensor_config0;
/* 0x4a0 */	u32 pmc_tsensor_config1;
/* 0x4a4 */	u32 pmc_tsensor_config2;
/* 0x4a8 */	u32 pmc_tsensor_status0;
/* 0x4ac */	u32 pmc_tsensor_status1;
/* 0x4b0 */	u32 pmc_tsensor_status2;
/* 0x4b4 */	u32 pmc_tsensor_pdiv;
/* 0x4b8 */	u32 pmc_aotag_intr_en;
/* 0x4bc */	u32 pmc_aotag_intr_dis;
/* 0x4c0 */	u32 pmc_utmip_pad_cfg0;
/* 0x4c4 */	u32 pmc_utmip_pad_cfg1;
/* 0x4c8 */	u32 pmc_utmip_pad_cfg2;
/* 0x4cc */	u32 pmc_utmip_pad_cfg3;
/* 0x4d0 */	u32 pmc_utmip_uhsic_sleep_cfg1;
/* 0x4d4 */	u32 pmc_cc4_hvc_control;
/* 0x4d8 */	u32 pmc_wake_debounce_en;
/* 0x4dc */	u32 pmc_ramdump_ctl_status;
/* 0x4e0 */	u32 pmc_utmip_sleepwalk_p3;
/* 0x4e4 */	u32 pmc_ddr_cntrl;
/* 0x4e8 */	u32 rsvd_4e8[50];
/* 0x5b0 */	u32 pmc_sec_disable4;
/* 0x5b4 */	u32 pmc_sec_disable5;
/* 0x5b8 */	u32 pmc_sec_disable6;
/* 0x5bc */	u32 pmc_sec_disable7;
/* 0x5c0 */	u32 pmc_sec_disable8;
/* 0x5c4 */	u32 pmc_sec_disable9_b01;
/* 0x5c8 */	u32 pmc_sec_disable10_b01;
/* 0x5cc */	u32 rsvd_5cc[13];
/* 0x600 */	u32 pmc_scratch56;
/* 0x604 */	u32 pmc_scratch57;
/* 0x608 */	u32 pmc_scratch58;
/* 0x60c */	u32 pmc_scratch59;
/* 0x610 */	u32 pmc_scratch60;
/* 0x614 */	u32 pmc_scratch61;
/* 0x618 */	u32 pmc_scratch62;
/* 0x61c */	u32 pmc_scratch63;
/* 0x620 */	u32 pmc_scratch64;
/* 0x624 */	u32 pmc_scratch65;
/* 0x628 */	u32 pmc_scratch66;
/* 0x62c */	u32 pmc_scratch67;
/* 0x630 */	u32 pmc_scratch68;
/* 0x634 */	u32 pmc_scratch69;
/* 0x638 */	u32 pmc_scratch70;
/* 0x63c */	u32 pmc_scratch71;
/* 0x640 */	u32 pmc_scratch72;
/* 0x644 */	u32 pmc_scratch73;
/* 0x648 */	u32 pmc_scratch74;
/* 0x64c */	u32 pmc_scratch75;
/* 0x650 */	u32 pmc_scratch76;
/* 0x654 */	u32 pmc_scratch77;
/* 0x658 */	u32 pmc_scratch78;
/* 0x65c */	u32 pmc_scratch79;
/* 0x660 */	u32 pmc_scratch80;
/* 0x664 */	u32 pmc_scratch81;
/* 0x668 */	u32 pmc_scratch82;
/* 0x66c */	u32 pmc_scratch83;
/* 0x670 */	u32 pmc_scratch84;
/* 0x674 */	u32 pmc_scratch85;
/* 0x678 */	u32 pmc_scratch86;
/* 0x67c */	u32 pmc_scratch87;
/* 0x680 */	u32 pmc_scratch88;
/* 0x684 */	u32 pmc_scratch89;
/* 0x688 */	u32 pmc_scratch90;
/* 0x68c */	u32 pmc_scratch91;
/* 0x690 */	u32 pmc_scratch92;
/* 0x694 */	u32 pmc_scratch93;
/* 0x698 */	u32 pmc_scratch94;
/* 0x69c */	u32 pmc_scratch95;
/* 0x6a0 */	u32 pmc_scratch96;
/* 0x6a4 */	u32 pmc_scratch97;
/* 0x6a8 */	u32 pmc_scratch98;
/* 0x6ac */	u32 pmc_scratch99;
/* 0x6b0 */	u32 pmc_scratch100;
/* 0x6b4 */	u32 pmc_scratch101;
/* 0x6b8 */	u32 pmc_scratch102;
/* 0x6bc */	u32 pmc_scratch103;
/* 0x6c0 */	u32 pmc_scratch104;
/* 0x6c4 */	u32 pmc_scratch105;
/* 0x6c8 */	u32 pmc_scratch106;
/* 0x6cc */	u32 pmc_scratch107;
/* 0x6d0 */	u32 pmc_scratch108;
/* 0x6d4 */	u32 pmc_scratch109;
/* 0x6d8 */	u32 pmc_scratch110;
/* 0x6dc */	u32 pmc_scratch111;
/* 0x6e0 */	u32 pmc_scratch112;
/* 0x6e4 */	u32 pmc_scratch113;
/* 0x6e8 */	u32 pmc_scratch114;
/* 0x6ec */	u32 pmc_scratch115;
/* 0x6f0 */	u32 pmc_scratch116;
/* 0x6f4 */	u32 pmc_scratch117;
/* 0x6f8 */	u32 pmc_scratch118;
/* 0x6fc */	u32 pmc_scratch119;
/* 0x700 */	u32 pmc_scratch120;
/* 0x704 */	u32 pmc_scratch121;
/* 0x708 */	u32 pmc_scratch122;
/* 0x70c */	u32 pmc_scratch123;
/* 0x710 */	u32 pmc_scratch124;
/* 0x714 */	u32 pmc_scratch125;
/* 0x718 */	u32 pmc_scratch126;
/* 0x71c */	u32 pmc_scratch127;
/* 0x720 */	u32 pmc_scratch128;
/* 0x724 */	u32 pmc_scratch129;
/* 0x728 */	u32 pmc_scratch130;
/* 0x72c */	u32 pmc_scratch131;
/* 0x730 */	u32 pmc_scratch132;
/* 0x734 */	u32 pmc_scratch133;
/* 0x738 */	u32 pmc_scratch134;
/* 0x73c */	u32 pmc_scratch135;
/* 0x740 */	u32 pmc_scratch136;
/* 0x744 */	u32 pmc_scratch137;
/* 0x748 */	u32 pmc_scratch138;
/* 0x74c */	u32 pmc_scratch139;
/* 0x750 */	u32 pmc_scratch140;
/* 0x754 */	u32 pmc_scratch141;
/* 0x758 */	u32 pmc_scratch142;
/* 0x75c */	u32 pmc_scratch143;
/* 0x760 */	u32 pmc_scratch144;
/* 0x764 */	u32 pmc_scratch145;
/* 0x768 */	u32 pmc_scratch146;
/* 0x76c */	u32 pmc_scratch147;
/* 0x770 */	u32 pmc_scratch148;
/* 0x774 */	u32 pmc_scratch149;
/* 0x778 */	u32 pmc_scratch150;
/* 0x77c */	u32 pmc_scratch151;
/* 0x780 */	u32 pmc_scratch152;
/* 0x784 */	u32 pmc_scratch153;
/* 0x788 */	u32 pmc_scratch154;
/* 0x78c */	u32 pmc_scratch155;
/* 0x790 */	u32 pmc_scratch156;
/* 0x794 */	u32 pmc_scratch157;
/* 0x798 */	u32 pmc_scratch158;
/* 0x79c */	u32 pmc_scratch159;
/* 0x7a0 */	u32 pmc_scratch160;
/* 0x7a4 */	u32 pmc_scratch161;
/* 0x7a8 */	u32 pmc_scratch162;
/* 0x7ac */	u32 pmc_scratch163;
/* 0x7b0 */	u32 pmc_scratch164;
/* 0x7b4 */	u32 pmc_scratch165;
/* 0x7b8 */	u32 pmc_scratch166;
/* 0x7bc */	u32 pmc_scratch167;
/* 0x7c0 */	u32 pmc_scratch168;
/* 0x7c4 */	u32 pmc_scratch169;
/* 0x7c8 */	u32 pmc_scratch170;
/* 0x7cc */	u32 pmc_scratch171;
/* 0x7d0 */	u32 pmc_scratch172;
/* 0x7d4 */	u32 pmc_scratch173;
/* 0x7d8 */	u32 pmc_scratch174;
/* 0x7dc */	u32 pmc_scratch175;
/* 0x7e0 */	u32 pmc_scratch176;
/* 0x7e4 */	u32 pmc_scratch177;
/* 0x7e8 */	u32 pmc_scratch178;
/* 0x7ec */	u32 pmc_scratch179;
/* 0x7f0 */	u32 pmc_scratch180;
/* 0x7f4 */	u32 pmc_scratch181;
/* 0x7f8 */	u32 pmc_scratch182;
/* 0x7fc */	u32 pmc_scratch183;
/* 0x800 */	u32 pmc_scratch184;
/* 0x804 */	u32 pmc_scratch185;
/* 0x808 */	u32 pmc_scratch186;
/* 0x80c */	u32 pmc_scratch187;
/* 0x810 */	u32 pmc_scratch188;
/* 0x814 */	u32 pmc_scratch189;
/* 0x818 */	u32 pmc_scratch190;
/* 0x81c */	u32 pmc_scratch191;
/* 0x820 */	u32 pmc_scratch192;
/* 0x824 */	u32 pmc_scratch193;
/* 0x828 */	u32 pmc_scratch194;
/* 0x82c */	u32 pmc_scratch195;
/* 0x830 */	u32 pmc_scratch196;
/* 0x834 */	u32 pmc_scratch197;
/* 0x838 */	u32 pmc_scratch198;
/* 0x83c */	u32 pmc_scratch199;
/* 0x840 */	u32 pmc_scratch200;
/* 0x844 */	u32 pmc_scratch201;
/* 0x848 */	u32 pmc_scratch202;
/* 0x84c */	u32 pmc_scratch203;
/* 0x850 */	u32 pmc_scratch204;
/* 0x854 */	u32 pmc_scratch205;
/* 0x858 */	u32 pmc_scratch206;
/* 0x85c */	u32 pmc_scratch207;
/* 0x860 */	u32 pmc_scratch208;
/* 0x864 */	u32 pmc_scratch209;
/* 0x868 */	u32 pmc_scratch210;
/* 0x86c */	u32 pmc_scratch211;
/* 0x870 */	u32 pmc_scratch212;
/* 0x874 */	u32 pmc_scratch213;
/* 0x878 */	u32 pmc_scratch214;
/* 0x87c */	u32 pmc_scratch215;
/* 0x880 */	u32 pmc_scratch216;
/* 0x884 */	u32 pmc_scratch217;
/* 0x888 */	u32 pmc_scratch218;
/* 0x88c */	u32 pmc_scratch219;
/* 0x890 */	u32 pmc_scratch220;
/* 0x894 */	u32 pmc_scratch221;
/* 0x898 */	u32 pmc_scratch222;
/* 0x89c */	u32 pmc_scratch223;
/* 0x8a0 */	u32 pmc_scratch224;
/* 0x8a4 */	u32 pmc_scratch225;
/* 0x8a8 */	u32 pmc_scratch226;
/* 0x8ac */	u32 pmc_scratch227;
/* 0x8b0 */	u32 pmc_scratch228;
/* 0x8b4 */	u32 pmc_scratch229;
/* 0x8b8 */	u32 pmc_scratch230;
/* 0x8bc */	u32 pmc_scratch231;
/* 0x8c0 */	u32 pmc_scratch232;
/* 0x8c4 */	u32 pmc_scratch233;
/* 0x8c8 */	u32 pmc_scratch234;
/* 0x8cc */	u32 pmc_scratch235;
/* 0x8d0 */	u32 pmc_scratch236;
/* 0x8d4 */	u32 pmc_scratch237;
/* 0x8d8 */	u32 pmc_scratch238;
/* 0x8dc */	u32 pmc_scratch239;
/* 0x8e0 */	u32 pmc_scratch240;
/* 0x8e4 */	u32 pmc_scratch241;
/* 0x8e8 */	u32 pmc_scratch242;
/* 0x8ec */	u32 pmc_scratch243;
/* 0x8f0 */	u32 pmc_scratch244;
/* 0x8f4 */	u32 pmc_scratch245;
/* 0x8f8 */	u32 pmc_scratch246;
/* 0x8fc */	u32 pmc_scratch247;
/* 0x900 */	u32 pmc_scratch248;
/* 0x904 */	u32 pmc_scratch249;
/* 0x908 */	u32 pmc_scratch250;
/* 0x90c */	u32 pmc_scratch251;
/* 0x910 */	u32 pmc_scratch252;
/* 0x914 */	u32 pmc_scratch253;
/* 0x918 */	u32 pmc_scratch254;
/* 0x91c */	u32 pmc_scratch255;
/* 0x920 */	u32 pmc_scratch256;
/* 0x924 */	u32 pmc_scratch257;
/* 0x928 */	u32 pmc_scratch258;
/* 0x92c */	u32 pmc_scratch259;
/* 0x930 */	u32 pmc_scratch260;
/* 0x934 */	u32 pmc_scratch261;
/* 0x938 */	u32 pmc_scratch262;
/* 0x93c */	u32 pmc_scratch263;
/* 0x940 */	u32 pmc_scratch264;
/* 0x944 */	u32 pmc_scratch265;
/* 0x948 */	u32 pmc_scratch266;
/* 0x94c */	u32 pmc_scratch267;
/* 0x950 */	u32 pmc_scratch268;
/* 0x954 */	u32 pmc_scratch269;
/* 0x958 */	u32 pmc_scratch270;
/* 0x95c */	u32 pmc_scratch271;
/* 0x960 */	u32 pmc_scratch272;
/* 0x964 */	u32 pmc_scratch273;
/* 0x968 */	u32 pmc_scratch274;
/* 0x96c */	u32 pmc_scratch275;
/* 0x970 */	u32 pmc_scratch276;
/* 0x974 */	u32 pmc_scratch277;
/* 0x978 */	u32 pmc_scratch278;
/* 0x97c */	u32 pmc_scratch279;
/* 0x980 */	u32 pmc_scratch280;
/* 0x984 */	u32 pmc_scratch281;
/* 0x988 */	u32 pmc_scratch282;
/* 0x98c */	u32 pmc_scratch283;
/* 0x990 */	u32 pmc_scratch284;
/* 0x994 */	u32 pmc_scratch285;
/* 0x998 */	u32 pmc_scratch286;
/* 0x99c */	u32 pmc_scratch287;
/* 0x9a0 */	u32 pmc_scratch288;
/* 0x9a4 */	u32 pmc_scratch289;
/* 0x9a8 */	u32 pmc_scratch290;
/* 0x9ac */	u32 pmc_scratch291;
/* 0x9b0 */	u32 pmc_scratch292;
/* 0x9b4 */	u32 pmc_scratch293;
/* 0x9b8 */	u32 pmc_scratch294;
/* 0x9bc */	u32 pmc_scratch295;
/* 0x9c0 */	u32 pmc_scratch296;
/* 0x9c4 */	u32 pmc_scratch297;
/* 0x9c8 */	u32 pmc_scratch298;
/* 0x9cc */	u32 pmc_scratch299;
/* 0x9d0 */	u32 rsvd_9d0[30];
/* 0xa48 */	u32 pmc_scratch_write_disable0_b01;
/* 0xa4c */	u32 pmc_scratch_write_disable1_b01;
/* 0xa50 */	u32 pmc_scratch_write_disable2_b01;
/* 0xa54 */	u32 pmc_scratch_write_disable3_b01;
/* 0xa58 */	u32 pmc_scratch_write_disable4_b01;
/* 0xa5c */	u32 pmc_scratch_write_disable5_b01;
/* 0xa60 */	u32 pmc_scratch_write_disable6_b01;
/* 0xa64 */	u32 pmc_scratch_write_disable7_b01;
/* 0xa68 */	u32 pmc_scratch_write_disable8_b01;
/* 0xa6c */	u32 pmc_scratch_write_disable9_b01;
/* 0xa70 */	u32 pmc_scratch_write_disable10_b01;
/* 0xa74 */	u32 pmc_scratch_write_lock_disable_sticky_b01;
/* 0xa78 */	u32 rsvd_a78[8];
/* 0xa98 */	u32 pmc_secure_scratch80;
/* 0xa9c */	u32 pmc_secure_scratch81;
/* 0xaa0 */	u32 pmc_secure_scratch82;
/* 0xaa4 */	u32 pmc_secure_scratch83;
/* 0xaa8 */	u32 pmc_secure_scratch84;
/* 0xaac */	u32 pmc_secure_scratch85;
/* 0xab0 */	u32 pmc_secure_scratch86;
/* 0xab4 */	u32 pmc_secure_scratch87;
/* 0xab8 */	u32 pmc_secure_scratch88;
/* 0xabc */	u32 pmc_secure_scratch89;
/* 0xac0 */	u32 pmc_secure_scratch90;
/* 0xac4 */	u32 pmc_secure_scratch91;
/* 0xac8 */	u32 pmc_secure_scratch92;
/* 0xacc */	u32 pmc_secure_scratch93;
/* 0xad0 */	u32 pmc_secure_scratch94;
/* 0xad4 */	u32 pmc_secure_scratch95;
/* 0xad8 */	u32 pmc_secure_scratch96;
/* 0xadc */	u32 pmc_secure_scratch97;
/* 0xae0 */	u32 pmc_secure_scratch98;
/* 0xae4 */	u32 pmc_secure_scratch99;
/* 0xae8 */	u32 pmc_secure_scratch100;
/* 0xaec */	u32 pmc_secure_scratch101;
/* 0xaf0 */	u32 pmc_secure_scratch102;
/* 0xaf4 */	u32 pmc_secure_scratch103;
/* 0xaf8 */	u32 pmc_secure_scratch104;
/* 0xafc */	u32 pmc_secure_scratch105;
/* 0xb00 */	u32 pmc_secure_scratch106;
/* 0xb04 */	u32 pmc_secure_scratch107;
/* 0xb08 */	u32 pmc_secure_scratch108;
/* 0xb0c */	u32 pmc_secure_scratch109;
/* 0xb10 */	u32 pmc_secure_scratch110;
/* 0xb14 */	u32 pmc_secure_scratch111;
/* 0xb18 */	u32 pmc_secure_scratch112;
/* 0xb1c */	u32 pmc_secure_scratch113;
/* 0xb20 */	u32 pmc_secure_scratch114;
/* 0xb24 */	u32 pmc_secure_scratch115;
/* 0xb28 */	u32 pmc_secure_scratch116;
/* 0xb2c */	u32 pmc_secure_scratch117;
/* 0xb30 */	u32 pmc_secure_scratch118;
/* 0xb34 */	u32 pmc_secure_scratch119;
/* 0xb38 */	u32 pmc_secure_scratch120_b01;
/* 0xb3c */	u32 pmc_secure_scratch121_b01;
/* 0xb40 */	u32 pmc_secure_scratch122_b01;
/* 0xb44 */	u32 pmc_secure_scratch123_b01;
/* 0xb48 */	u32 pmc_led_breathing_ctrl_b01;
/* 0xb4c */	u32 pmc_led_breathing_counter0_b01; // Slope Steps.
/* 0xb50 */	u32 pmc_led_breathing_counter1_b01; // ON counter.
/* 0xb54 */	u32 pmc_led_breathing_counter2_b01; // OFF counter1.
/* 0xb58 */	u32 pmc_led_breathing_counter3_b01; // OFF counter0.
/* 0xb5c */	u32 pmc_led_breathing_status_b01;
/* 0xb60 */	u32 rsvd_b60[2];
/* 0xb68 */	u32 pmc_secure_scratch124_b01;
/* 0xb6c */	u32 pmc_secure_scratch125_b01;
/* 0xb70 */	u32 pmc_secure_scratch126_b01;
/* 0xb74 */	u32 pmc_secure_scratch127_b01;
/* 0xb78 */	u32 pmc_secure_scratch128_b01;
/* 0xb7c */	u32 pmc_secure_scratch129_b01;
/* 0xb80 */	u32 pmc_secure_scratch130_b01;
/* 0xb84 */	u32 pmc_secure_scratch131_b01;
/* 0xb88 */	u32 pmc_secure_scratch132_b01;
/* 0xb8c */	u32 pmc_secure_scratch133_b01;
/* 0xb90 */	u32 pmc_secure_scratch134_b01;
/* 0xb94 */	u32 pmc_secure_scratch135_b01;
/* 0xb98 */	u32 pmc_secure_scratch136_b01;
/* 0xb9c */	u32 pmc_secure_scratch137_b01;
/* 0xba0 */	u32 pmc_secure_scratch138_b01;
/* 0xba4 */	u32 pmc_secure_scratch139_b01;
/* 0xba8 */	u32 rsvd_ba8[2];
/* 0xbb0 */	u32 pmc_sec_disable_ns_b01;
/* 0xbb4 */	u32 pmc_sec_disable2_ns_b01;
/* 0xbb8 */	u32 pmc_sec_disable3_ns_b01;
/* 0xbbc */	u32 pmc_sec_disable4_ns_b01;
/* 0xbc0 */	u32 pmc_sec_disable5_ns_b01;
/* 0xbc4 */	u32 pmc_sec_disable6_ns_b01;
/* 0xbc8 */	u32 pmc_sec_disable7_ns_b01;
/* 0xbcc */	u32 pmc_sec_disable8_ns_b01;
/* 0xbd0 */	u32 pmc_sec_disable9_ns_b01;
/* 0xbd4 */	u32 pmc_sec_disable10_ns_b01;
/* 0xbd8 */	u32 rsvd_bd8[4];
/* 0xbe8 */	u32 pmc_tzram_pwr_cntrl_b01;
/* 0xbec */	u32 pmc_tzram_sec_disable_b01;
/* 0xbf0 */	u32 pmc_tzram_non_sec_disable_b01;
} pmc_regs_t210_t;

#endif	/* _PMC_T210_H_ */
