/*
 * Copyright (c) 2018-2025 CTCaer
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms and conditions of the GNU General Public License,
 * version 2, as published by the Free Software Foundation.
 *
 * This program is distributed in the hope it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#ifndef _MC_T210_H_
#define _MC_T210_H_

/* Memory Controller registers */
#define MC_INTSTATUS                                        0x0
#define MC_INTMASK                                          0x4
#define MC_ERR_STATUS                                       0x8
#define MC_ERR_ADR                                          0xC
#define MC_SMMU_CONFIG                                      0x10
#define MC_SMMU_TLB_CONFIG                                  0x14
#define MC_SMMU_PTC_CONFIG                                  0x18
#define MC_SMMU_PTB_ASID                                    0x1C
#define MC_SMMU_PTB_DATA                                    0x20
#define MC_SMMU_TLB_FLUSH                                   0x30
#define MC_SMMU_PTC_FLUSH                                   0x34
#define MC_SMMU_ASID_SECURITY                               0x38

#define SEC_CARVEOUT_CFG_DIS_RD_CHECK_FLCN_HS (8 << DISABLE_READ_CHECK_ACCESS_LEVEL_SHIFT)

#define DISABLE_WRITE_CHECK_ACCESS_LEVEL_SHIFT 18
#define SEC_CARVEOUT_CFG_DIS_WR_CHECK_NS (1 << DISABLE_WRITE_CHECK_ACCESS_LEVEL_SHIFT)
#define SEC_CARVEOUT_CFG_DIS_WR_CHECK_SEC (2 << DISABLE_WRITE_CHECK_ACCESS_LEVEL_SHIFT)
#define SEC_CARVEOUT_CFG_DIS_WR_CHECK_FLCN_LS (4 << DISABLE_WRITE_CHECK_ACCESS_LEVEL_SHIFT)
#define SEC_CARVEOUT_CFG_DIS_WR_CHECK_FLCN_HS (8 << DISABLE_WRITE_CHECK_ACCESS_LEVEL_SHIFT)

#define SEC_CARVEOUT_CFG_SEND_CFG_TO_GPU BIT(22)

#define SEC_CARVEOUT_CFG_TZ_GLOBAL_WR_EN_BYPASS_CHECK BIT(23)
#define SEC_CARVEOUT_CFG_TZ_GLOBAL_RD_EN_BYPASS_CHECK BIT(24)

#define SEC_CARVEOUT_CFG_ALLOW_APERTURE_ID_MISMATCH BIT(25)
#define SEC_CARVEOUT_CFG_FORCE_APERTURE_ID_MATCH    BIT(26)

#define SEC_CARVEOUT_CFG_IS_WPR BIT(27)

// WPR1 magic to enable WPR2.
#define ACR_GSC3_ENABLE_MAGIC 0xC0EDBBCC

/*! MC_VIDEO_PROTECT_GPU_OVERRIDE_0 */
// VPR CYA. Parsed as (vpr_gpu_ovr1 << 32 | vpr_gpu_ovr0) << 5.
#define VPR_TRUST_UNTRUSTED  0
#define VPR_TRUST_GRAPHICS   1
#define VPR_TRUST_QUARANTINE 2
#define VPR_TRUST_TRUSTED    3
// VPR CYA LO.
// Setting VPR_OVR0_CYA_TRUST_DEFAULT disables the overrides.
// Defaults: PD, SCC, SKED, L1, TEX, PE, RASTER, GCC and PROP as GRAPHICS. The rest UNTRUSTED.
#define VPR_OVR0_CYA_TRUST_OVERRIDE   0
#define VPR_OVR0_CYA_TRUST_DEFAULT    BIT(0)
#define VPR_OVR0_CYA_TRUST_CPU(t)     ((t) <<  1u) // HOST CPU.
#define VPR_OVR0_CYA_TRUST_HOST(t)    ((t) <<  3u)
#define VPR_OVR0_CYA_TRUST_PERF(t)    ((t) <<  5u)
#define VPR_OVR0_CYA_TRUST_PMU(t)     ((t) <<  7u)
#define VPR_OVR0_CYA_TRUST_CE2(t)     ((t) <<  9u) // GRCOPY.
#define VPR_OVR0_CYA_TRUST_SEC(t)     ((t) << 11u)
#define VPR_OVR0_CYA_TRUST_FE(t)      ((t) << 13u)
#define VPR_OVR0_CYA_TRUST_PD(t)      ((t) << 15u)
#define VPR_OVR0_CYA_TRUST_SCC(t)     ((t) << 17u)
#define VPR_OVR0_CYA_TRUST_SKED(t)    ((t) << 19u)
#define VPR_OVR0_CYA_TRUST_L1(t)      ((t) << 21u)
#define VPR_OVR0_CYA_TRUST_TEX(t)     ((t) << 23u)
#define VPR_OVR0_CYA_TRUST_PE(t)      ((t) << 25u)
// VPR CYA HI.
#define VPR_OVR0_CYA_TRUST_RASTER(t)  ((t) << 27u)
#define VPR_OVR0_CYA_TRUST_GCC(t)     ((t) << 29u)
// Setting GPCCS to anything other than untrusted, causes a hang.
#define VPR_OVR0_CYA_TRUST_GPCCS(t)   (((t) & 1) << 31u)

/*! MC_VIDEO_PROTECT_GPU_OVERRIDE_1 */
// VPR CYA HI.
#define VPR_OVR1_CYA_TRUST_GPCCS(t)   ((t) >> 1)
#define VPR_OVR1_CYA_TRUST_PROP(t)    ((t) <<  1u)
#define VPR_OVR1_CYA_TRUST_PROP_READ  BIT(3)
#define VPR_OVR1_CYA_TRUST_PROP_WRITE BIT(4)
#define VPR_OVR1_CYA_TRUST_DNISO(t)   ((t) <<  5u)
#define VPR_OVR1_CYA_TRUST_CE0(t)     VPR_OVR1_CYA_TRUST_DNISO(t)
#define VPR_OVR1_CYA_TRUST_CE1(t)     VPR_OVR1_CYA_TRUST_DNISO(t)
#define VPR_OVR1_CYA_TRUST_NVENC(t)   ((t) <<  7u) // Unused?
#define VPR_OVR1_CYA_TRUST_NVDEC(t)   ((t) <<  9u) // Unused?
#define VPR_OVR1_CYA_TRUST_MSPPP(t)   ((t) << 11u) // Unused? VIC/JPG?
#define VPR_OVR1_CYA_TRUST_MSVLD(t)   ((t) << 13u) // Unused? SEC2?

typedef struct _mc_regs_t210_t {
/* 0x000 */	u32 mc_intstatus;
/* 0x004 */	u32 mc_intmask;
/* 0x008 */	u32 mc_err_status;
/* 0x00c */	u32 mc_err_adr;
/* 0x010 */	u32 mc_smmu_config;
/* 0x014 */	u32 mc_smmu_tlb_config;
/* 0x018 */	u32 mc_smmu_ptc_config;
/* 0x01c */	u32 mc_smmu_ptb_asid;
/* 0x020 */	u32 mc_smmu_ptb_data;
/* 0x024 */	u32 rsvd_024[3];
/* 0x030 */	u32 mc_smmu_tlb_flush;
/* 0x034 */	u32 mc_smmu_ptc_flush;
/* 0x038 */	u32 mc_smmu_asid_security;
/* 0x03c */	u32 mc_smmu_asid_security_1;
/* 0x040 */	u32 mc_smmu_client_config0;
/* 0x044 */	u32 mc_smmu_client_config1;
/* 0x048 */	u32 mc_smmu_client_config2;
/* 0x04c */	u32 mc_smmu_client_config3;
/* 0x050 */	u32 mc_emem_cfg;
/* 0x054 */	u32 mc_emem_adr_cfg;
/* 0x058 */	u32 mc_emem_adr_cfg_dev0;
/* 0x05c */	u32 mc_emem_adr_cfg_dev1;
/* 0x060 */	u32 mc_emem_adr_cfg_channel_mask;
/* 0x064 */	u32 mc_emem_adr_cfg_bank_mask_0;
/* 0x068 */	u32 mc_emem_adr_cfg_bank_mask_1;
/* 0x06c */	u32 mc_emem_adr_cfg_bank_mask_2;
/* 0x070 */	u32 mc_security_cfg0;
/* 0x074 */	u32 mc_security_cfg1;
/* 0x078 */	u32 rsvd_078;
/* 0x07c */	u32 mc_security_rsv;
/* 0x080 */	u32 rsvd_080[4];
/* 0x090 */	u32 mc_emem_arb_cfg;
/* 0x094 */	u32 mc_emem_arb_outstanding_req;
/* 0x098 */	u32 mc_emem_arb_timing_rcd;
/* 0x09c */	u32 mc_emem_arb_timing_rp;
/* 0x0a0 */	u32 mc_emem_arb_timing_rc;
/* 0x0a4 */	u32 mc_emem_arb_timing_ras;
/* 0x0a8 */	u32 mc_emem_arb_timing_faw;
/* 0x0ac */	u32 mc_emem_arb_timing_rrd;
/* 0x0b0 */	u32 mc_emem_arb_timing_rap2pre;
/* 0x0b4 */	u32 mc_emem_arb_timing_wap2pre;
/* 0x0b8 */	u32 mc_emem_arb_timing_r2r;
/* 0x0bc */	u32 mc_emem_arb_timing_w2w;
/* 0x0c0 */	u32 mc_emem_arb_timing_r2w;
/* 0x0c4 */	u32 mc_emem_arb_timing_w2r;
/* 0x0c8 */	u32 mc_emem_arb_misc2;
/* 0x0cc */	u32 rsvd_0cc;
/* 0x0d0 */	u32 mc_emem_arb_da_turns;
/* 0x0d4 */	u32 mc_emem_arb_da_covers;
/* 0x0d8 */	u32 mc_emem_arb_misc0;
/* 0x0dc */	u32 mc_emem_arb_misc1;
/* 0x0e0 */	u32 mc_emem_arb_ring1_throttle;
/* 0x0e4 */	u32 mc_emem_arb_ring3_throttle;
/* 0x0e8 */	u32 mc_emem_arb_override;
/* 0x0ec */	u32 mc_emem_arb_rsv;
/* 0x0f0 */	u32 rsvd_0f0;
/* 0x0f4 */	u32 mc_clken_override;
/* 0x0f8 */	u32 mc_timing_control_dbg;
/* 0x0fc */	u32 mc_timing_control;
/* 0x100 */	u32 mc_stat_control;
/* 0x104 */	u32 mc_stat_status;
/* 0x108 */	u32 mc_stat_emc_clock_limit;
/* 0x10c */	u32 mc_stat_emc_clock_limit_msbs;
/* 0x110 */	u32 mc_stat_emc_clocks;
/* 0x114 */	u32 mc_stat_emc_clocks_msbs;
/* 0x118 */	u32 mc_stat_emc_filter_set0_adr_limit_lo;
/* 0x11c */	u32 mc_stat_emc_filter_set0_adr_limit_hi;
/* 0x120 */	u32 mc_stat_emc_filter_set0_slack_limit;
/* 0x124 */	u32 rsvd_124;
/* 0x128 */	u32 mc_stat_emc_filter_set0_client_0;
/* 0x12c */	u32 mc_stat_emc_filter_set0_client_1;
/* 0x130 */	u32 mc_stat_emc_filter_set0_client_2;
/* 0x134 */	u32 mc_stat_emc_filter_set0_client_3;
/* 0x138 */	u32 mc_stat_emc_set0_count;
/* 0x13c */	u32 mc_stat_emc_set0_count_msbs;
/* 0x140 */	u32 mc_stat_emc_set0_slack_accum;
/* 0x144 */	u32 mc_stat_emc_set0_slack_accum_msbs;
/* 0x148 */	u32 mc_stat_emc_set0_histo_count;
/* 0x14c */	u32 mc_stat_emc_set0_histo_count_msbs;
/* 0x150 */	u32 mc_stat_emc_set0_minimum_slack_observed;
/* 0x154 */	u32 rsvd_154;
/* 0x158 */	u32 mc_stat_emc_filter_set1_adr_limit_lo;
/* 0x15c */	u32 mc_stat_emc_filter_set1_adr_limit_hi;
/* 0x160 */	u32 mc_stat_emc_filter_set1_slack_limit;
/* 0x164 */	u32 rsvd_164;
/* 0x168 */	u32 mc_stat_emc_filter_set1_client_0;
/* 0x16c */	u32 mc_stat_emc_filter_set1_client_1;
/* 0x170 */	u32 mc_stat_emc_filter_set1_client_2;
/* 0x174 */	u32 mc_stat_emc_filter_set1_client_3;
/* 0x178 */	u32 mc_stat_emc_set1_count;
/* 0x17c */	u32 mc_stat_emc_set1_count_msbs;
/* 0x180 */	u32 mc_stat_emc_set1_slack_accum;
/* 0x184 */	u32 mc_stat_emc_set1_slack_accum_msbs;
/* 0x188 */	u32 mc_stat_emc_set1_histo_count;
/* 0x18c */	u32 mc_stat_emc_set1_histo_count_msbs;
/* 0x190 */	u32 mc_stat_emc_set1_minimum_slack_observed;
/* 0x194 */	u32 rsvd_194;
/* 0x198 */	u32 mc_stat_emc_filter_set0_virtual_adr_limit_lo;
/* 0x19c */	u32 mc_stat_emc_filter_set0_virtual_adr_limit_hi;
/* 0x1a0 */	u32 mc_stat_emc_filter_set0_asid;
/* 0x1a4 */	u32 rsvd_1a4;
/* 0x1a8 */	u32 mc_stat_emc_filter_set1_virtual_adr_limit_lo;
/* 0x1ac */	u32 mc_stat_emc_filter_set1_virtual_adr_limit_hi;
/* 0x1b0 */	u32 mc_stat_emc_filter_set1_asid;
/* 0x1b4 */	u32 rsvd_1b4;
/* 0x1b8 */	u32 mc_stat_emc_set0_idle_cycle_count;
/* 0x1bc */	u32 mc_stat_emc_set0_idle_cycle_count_msbs;
/* 0x1c0 */	u32 mc_stat_emc_set0_idle_cycle_partition_select;
/* 0x1c4 */	u32 rsvd_1c4;
/* 0x1c8 */	u32 mc_stat_emc_set1_idle_cycle_count;
/* 0x1cc */	u32 mc_stat_emc_set1_idle_cycle_count_msbs;
/* 0x1d0 */	u32 mc_stat_emc_set1_idle_cycle_partition_select;
/* 0x1d4 */	u32 rsvd_1d4[6];
/* 0x1ec */	u32 mc_smmu_stats_tlb_hit_miss_source;
/* 0x1f0 */	u32 mc_smmu_stats_tlb_hit_count;
/* 0x1f4 */	u32 mc_smmu_stats_tlb_miss_count;
/* 0x1f8 */	u32 mc_smmu_stats_ptc_hit_count;
/* 0x1fc */	u32 mc_smmu_stats_ptc_miss_count;
/* 0x200 */	u32 mc_client_hotreset_ctrl;
/* 0x204 */	u32 mc_client_hotreset_status;
/* 0x208 */	u32 mc_emem_arb_isochronous_0;
/* 0x20c */	u32 mc_emem_arb_isochronous_1;
/* 0x210 */	u32 mc_emem_arb_isochronous_2;
/* 0x214 */	u32 mc_emem_arb_isochronous_3;
/* 0x218 */	u32 mc_emem_arb_hysteresis_0;
/* 0x21c */	u32 mc_emem_arb_hysteresis_1;
/* 0x220 */	u32 mc_emem_arb_hysteresis_2;
/* 0x224 */	u32 mc_emem_arb_hysteresis_3;
/* 0x228 */	u32 mc_smmu_translation_enable_0;
/* 0x22c */	u32 mc_smmu_translation_enable_1;
/* 0x230 */	u32 mc_smmu_translation_enable_2;
/* 0x234 */	u32 mc_smmu_translation_enable_3;
/* 0x238 */	u32 mc_smmu_afi_asid;
/* 0x23c */	u32 mc_smmu_avpc_asid;
/* 0x240 */	u32 mc_smmu_dc_asid;
/* 0x244 */	u32 mc_smmu_dcb_asid;
/* 0x248 */	u32 rsvd_248[2];
/* 0x250 */	u32 mc_smmu_hc_asid;
/* 0x254 */	u32 mc_smmu_hda_asid;
/* 0x258 */	u32 mc_smmu_isp2_asid;
/* 0x25c */	u32 rsvd_25c[2];
/* 0x264 */	u32 mc_smmu_nvenc_asid;
/* 0x268 */	u32 rsvd_268[2];
/* 0x270 */	u32 mc_smmu_ppcs_asid;
/* 0x274 */	u32 mc_smmu_sata_asid;
/* 0x278 */	u32 rsvd_278[2];
/* 0x280 */	u32 mc_smmu_vi_asid;
/* 0x284 */	u32 mc_smmu_vic_asid;
/* 0x288 */	u32 mc_smmu_xusb_host_asid;
/* 0x28c */	u32 mc_smmu_xusb_dev_asid;
/* 0x290 */	u32 mc_smmu_a9avp_asid;
/* 0x294 */	u32 mc_smmu_tsec_asid;
/* 0x298 */	u32 mc_smmu_ppcs1_asid;
/* 0x29c */	u32 rsvd_29c;
/* 0x2a0 */	u32 mc_ahb_extra_snap_levels;
/* 0x2a4 */	u32 mc_apb_extra_snap_levels;
/* 0x2a8 */	u32 mc_avp_extra_snap_levels;
/* 0x2ac */	u32 mc_dis_extra_snap_levels;
/* 0x2b0 */	u32 rsvd_2b0[2];
/* 0x2b8 */	u32 mc_pcx_extra_snap_levels;
/* 0x2bc */	u32 mc_ftop_extra_snap_levels;
/* 0x2c0 */	u32 mc_sax_extra_snap_levels;
/* 0x2c4 */	u32 rsvd_2c4[5];
/* 0x2d8 */	u32 mc_ve_extra_snap_levels;
/* 0x2dc */	u32 rsvd_2dc;
/* 0x2e0 */	u32 mc_latency_allowance_afi_0;
/* 0x2e4 */	u32 mc_latency_allowance_avpc_0;
/* 0x2e8 */	u32 mc_latency_allowance_dc_0;
/* 0x2ec */	u32 mc_latency_allowance_dc_1;
/* 0x2f0 */	u32 mc_latency_allowance_dc_2;
/* 0x2f4 */	u32 mc_latency_allowance_dcb_0;
/* 0x2f8 */	u32 mc_latency_allowance_dcb_1;
/* 0x2fc */	u32 mc_latency_allowance_dcb_2;
/* 0x300 */	u32 rsvd_300[4];
/* 0x310 */	u32 mc_latency_allowance_hc_0;
/* 0x314 */	u32 mc_latency_allowance_hc_1;
/* 0x318 */	u32 mc_latency_allowance_hda_0;
/* 0x31c */	u32 rsvd_31c;
/* 0x320 */	u32 mc_latency_allowance_mpcore_0;
/* 0x324 */	u32 rsvd_324;
/* 0x328 */	u32 mc_latency_allowance_nvenc_0;
/* 0x32c */	u32 rsvd_32c[6];
/* 0x344 */	u32 mc_latency_allowance_ppcs_0;
/* 0x348 */	u32 mc_latency_allowance_ppcs_1;
/* 0x34c */	u32 mc_latency_allowance_ptc_0;
/* 0x350 */	u32 mc_latency_allowance_sata_0;
/* 0x354 */	u32 rsvd_354[7];
/* 0x370 */	u32 mc_latency_allowance_isp2_0;
/* 0x374 */	u32 mc_latency_allowance_isp2_1;
/* 0x378 */	u32 rsvd_378;
/* 0x37c */	u32 mc_latency_allowance_xusb_0;
/* 0x380 */	u32 mc_latency_allowance_xusb_1;
/* 0x384 */	u32 mc_latency_allowance_isp2b_0;
/* 0x388 */	u32 mc_latency_allowance_isp2b_1;
/* 0x38c */	u32 rsvd_38c;
/* 0x390 */	u32 mc_latency_allowance_tsec_0;
/* 0x394 */	u32 mc_latency_allowance_vic_0;
/* 0x398 */	u32 mc_latency_allowance_vi2_0;
/* 0x39c */	u32 rsvd_39c;
/* 0x3a0 */	u32 mc_latency_allowance_axiap_0;
/* 0x3a4 */	u32 mc_latency_allowance_a9avp_0;
/* 0x3a8 */	u32 rsvd_3a8;
/* 0x3ac */	u32 mc_latency_allowance_gpu_0;
/* 0x3b0 */	u32 rsvd_3b0[2];
/* 0x3b8 */	u32 mc_latency_allowance_sdmmca_0;
/* 0x3bc */	u32 mc_latency_allowance_sdmmcaa_0;
/* 0x3c0 */	u32 mc_latency_allowance_sdmmc_0;
/* 0x3c4 */	u32 mc_latency_allowance_sdmmcab_0;
/* 0x3c8 */	u32 mc_latency_allowance_dc_3;
/* 0x3cc */	u32 rsvd_3cc[3];
/* 0x3d8 */	u32 mc_latency_allowance_nvdec_0;
/* 0x3dc */	u32 mc_latency_allowance_ape_0;
/* 0x3e0 */	u32 mc_latency_allowance_se_0;
/* 0x3e4 */	u32 mc_latency_allowance_nvjpg_0;
/* 0x3e8 */	u32 mc_latency_allowance_gpu2_0;
/* 0x3ec */	u32 mc_latency_allowance_etr_0;
/* 0x3f0 */	u32 mc_latency_allowance_tsecb_0;
/* 0x3f4 */	u32 rsvd_3f4[2];
/* 0x3fc */	u32 mc_reserved_rsv;
/* 0x400 */	u32 rsvd_400;
/* 0x404 */	u32 mc_usbx_extra_snap_levels;
/* 0x408 */	u32 mc_disb_extra_snap_levels;
/* 0x40c */	u32 mc_mse_extra_snap_levels;
/* 0x410 */	u32 mc_ve2_extra_snap_levels;
/* 0x414 */	u32 mc_a9avppc_extra_snap_levels;
/* 0x418 */	u32 mc_video_protect_vpr_override;
/* 0x41c */	u32 mc_dis_ptsa_rate;
/* 0x420 */	u32 mc_dis_ptsa_min;
/* 0x424 */	u32 mc_dis_ptsa_max;
/* 0x428 */	u32 mc_disb_ptsa_rate;
/* 0x42c */	u32 mc_disb_ptsa_min;
/* 0x430 */	u32 mc_disb_ptsa_max;
/* 0x434 */	u32 mc_ve_ptsa_rate;
/* 0x438 */	u32 mc_ve_ptsa_min;
/* 0x43c */	u32 mc_ve_ptsa_max;
/* 0x440 */	u32 mc_ring2_ptsa_rate;
/* 0x444 */	u32 mc_ring2_ptsa_min;
/* 0x448 */	u32 mc_ring2_ptsa_max;
/* 0x44c */	u32 mc_mll_mpcorer_ptsa_rate;
/* 0x450 */	u32 mc_mll_mpcorer_ptsa_min;
/* 0x454 */	u32 mc_mll_mpcorer_ptsa_max;
/* 0x458 */	u32 mc_smmu_smmu_ptsa_rate;
/* 0x45c */	u32 mc_smmu_smmu_ptsa_min;
/* 0x460 */	u32 mc_smmu_smmu_ptsa_max;
/* 0x464 */	u32 rsvd_464[6];
/* 0x47c */	u32 mc_ring1_ptsa_rate;
/* 0x480 */	u32 mc_ring1_ptsa_min;
/* 0x484 */	u32 mc_ring1_ptsa_max;
/* 0x488 */	u32 mc_a9avppc_ptsa_rate;
/* 0x48c */	u32 mc_a9avppc_ptsa_min;
/* 0x490 */	u32 mc_a9avppc_ptsa_max;
/* 0x494 */	u32 mc_ve2_ptsa_rate;
/* 0x498 */	u32 mc_ve2_ptsa_min;
/* 0x49c */	u32 mc_ve2_ptsa_max;
/* 0x4a0 */	u32 mc_isp_ptsa_rate;
/* 0x4a4 */	u32 mc_isp_ptsa_min;
/* 0x4a8 */	u32 mc_isp_ptsa_max;
/* 0x4ac */	u32 mc_pcx_ptsa_rate;
/* 0x4b0 */	u32 mc_pcx_ptsa_min;
/* 0x4b4 */	u32 mc_pcx_ptsa_max;
/* 0x4b8 */	u32 mc_sax_ptsa_rate;
/* 0x4bc */	u32 mc_sax_ptsa_min;
/* 0x4c0 */	u32 mc_sax_ptsa_max;
/* 0x4c4 */	u32 mc_mse_ptsa_rate;
/* 0x4c8 */	u32 mc_mse_ptsa_min;
/* 0x4cc */	u32 mc_mse_ptsa_max;
/* 0x4d0 */	u32 mc_sd_ptsa_rate;
/* 0x4d4 */	u32 mc_sd_ptsa_min;
/* 0x4d8 */	u32 mc_sd_ptsa_max;
/* 0x4dc */	u32 mc_ahb_ptsa_rate;
/* 0x4e0 */	u32 mc_ahb_ptsa_min;
/* 0x4e4 */	u32 mc_ahb_ptsa_max;
/* 0x4e8 */	u32 mc_apb_ptsa_rate;
/* 0x4ec */	u32 mc_apb_ptsa_min;
/* 0x4f0 */	u32 mc_apb_ptsa_max;
/* 0x4f4 */	u32 mc_avp_ptsa_rate;
/* 0x4f8 */	u32 mc_avp_ptsa_min;
/* 0x4fc */	u32 mc_avp_ptsa_max;
/* 0x500 */	u32 rsvd_500[3];
/* 0x50c */	u32 mc_ftop_ptsa_rate;
/* 0x510 */	u32 mc_ftop_ptsa_min;
/* 0x514 */	u32 mc_ftop_ptsa_max;
/* 0x518 */	u32 mc_host_ptsa_rate;
/* 0x51c */	u32 mc_host_ptsa_min;
/* 0x520 */	u32 mc_host_ptsa_max;
/* 0x524 */	u32 mc_usbx_ptsa_rate;
/* 0x528 */	u32 mc_usbx_ptsa_min;
/* 0x52c */	u32 mc_usbx_ptsa_max;
/* 0x530 */	u32 mc_usbd_ptsa_rate;
/* 0x534 */	u32 mc_usbd_ptsa_min;
/* 0x538 */	u32 mc_usbd_ptsa_max;
/* 0x53c */	u32 mc_gk_ptsa_rate;
/* 0x540 */	u32 mc_gk_ptsa_min;
/* 0x544 */	u32 mc_gk_ptsa_max;
/* 0x548 */	u32 mc_aud_ptsa_rate;
/* 0x54c */	u32 mc_aud_ptsa_min;
/* 0x550 */	u32 mc_aud_ptsa_max;
/* 0x554 */	u32 mc_vicpc_ptsa_rate;
/* 0x558 */	u32 mc_vicpc_ptsa_min;
/* 0x55c */	u32 mc_vicpc_ptsa_max;
/* 0x560 */	u32 rsvd_560[9];
/* 0x584 */	u32 mc_jpg_ptsa_rate;
/* 0x588 */	u32 mc_jpg_ptsa_min;
/* 0x58c */	u32 mc_jpg_ptsa_max;
/* 0x590 */	u32 mc_video_protect_vpr_override1;
/* 0x594 */	u32 rsvd_594[27];
/* 0x600 */	u32 mc_smmu_tlb_set_selection_mask_0;
/* 0x604 */	u32 rsvd_604[3];
/* 0x610 */	u32 mc_gk2_ptsa_rate;
/* 0x614 */	u32 mc_gk2_ptsa_min;
/* 0x618 */	u32 mc_gk2_ptsa_max;
/* 0x61c */	u32 mc_sdm_ptsa_rate;
/* 0x620 */	u32 mc_sdm_ptsa_min;
/* 0x624 */	u32 mc_sdm_ptsa_max;
/* 0x628 */	u32 mc_hdapc_ptsa_rate;
/* 0x62c */	u32 mc_hdapc_ptsa_min;
/* 0x630 */	u32 mc_hdapc_ptsa_max;
/* 0x634 */	u32 mc_dfd_ptsa_rate;
/* 0x638 */	u32 mc_dfd_ptsa_min;
/* 0x63c */	u32 mc_dfd_ptsa_max;
/* 0x640 */	u32 rsvd_640[2];
/* 0x648 */	u32 mc_video_protect_bom;
/* 0x64c */	u32 mc_video_protect_size_mb;
/* 0x650 */	u32 mc_video_protect_reg_ctrl;
/* 0x654 */	u32 mc_err_vpr_status;
/* 0x658 */	u32 mc_err_vpr_adr;
/* 0x65c */	u32 mc_iram_bom;
/* 0x660 */	u32 mc_iram_tom;
/* 0x664 */	u32 mc_emem_cfg_access_ctrl;
/* 0x668 */	u32 mc_tz_security_ctrl;
/* 0x66c */	u32 mc_emem_arb_outstanding_req_ring3;
/* 0x670 */	u32 mc_sec_carveout_bom;
/* 0x674 */	u32 mc_sec_carveout_size_mb;
/* 0x678 */	u32 mc_sec_carveout_reg_ctrl;
/* 0x67c */	u32 mc_err_sec_status;
/* 0x680 */	u32 mc_err_sec_adr;
/* 0x684 */	u32 mc_pc_idle_clock_gate_config;
/* 0x688 */	u32 mc_stutter_control;
/* 0x68c */	u32 rsvd_68c;
/* 0x690 */	u32 mc_scaled_latency_allowance_display0a;
/* 0x694 */	u32 mc_scaled_latency_allowance_display0ab;
/* 0x698 */	u32 mc_scaled_latency_allowance_display0b;
/* 0x69c */	u32 mc_scaled_latency_allowance_display0bb;
/* 0x6a0 */	u32 mc_scaled_latency_allowance_display0c;
/* 0x6a4 */	u32 mc_scaled_latency_allowance_display0cb;
/* 0x6a8 */	u32 rsvd_6a8[2];
/* 0x6b0 */	u32 mc_emem_arb_niso_throttle;
/* 0x6b4 */	u32 mc_emem_arb_outstanding_req_niso;
/* 0x6b8 */	u32 mc_emem_arb_niso_throttle_mask;
/* 0x6bc */	u32 mc_emem_arb_ring0_throttle_mask;
/* 0x6c0 */	u32 mc_emem_arb_timing_rfcpb;
/* 0x6c4 */	u32 mc_emem_arb_timing_ccdmw;
/* 0x6c8 */	u32 rsvd_6c8[10];
/* 0x6f0 */	u32 mc_emem_arb_refpb_hp_ctrl;
/* 0x6f4 */	u32 mc_emem_arb_refpb_bank_ctrl;
/* 0x6f8 */	u32 rsvd_6f8[67];
/* 0x804 */	u32 mc_smmu_isp21_asid_b01;
/* 0x808 */	u32 mc_smmu_isp2b1_asid_b01;
/* 0x80c */	u32 rsvd_80c[32];
/* 0x88c */	u32 mc_min_length_afi_0;
/* 0x890 */	u32 mc_min_length_avpc_0;
/* 0x894 */	u32 mc_min_length_dc_0;
/* 0x898 */	u32 mc_min_length_dc_1;
/* 0x89c */	u32 mc_min_length_dc_2;
/* 0x8a0 */	u32 mc_min_length_dcb_0;
/* 0x8a4 */	u32 mc_min_length_dcb_1;
/* 0x8a8 */	u32 mc_min_length_dcb_2;
/* 0x8ac */	u32 rsvd_8ac[4];
/* 0x8bc */	u32 mc_min_length_hc_0;
/* 0x8c0 */	u32 mc_min_length_hc_1;
/* 0x8c4 */	u32 mc_min_length_hda_0;
/* 0x8c8 */	u32 rsvd_8c8;
/* 0x8cc */	u32 mc_min_length_mpcore_0;
/* 0x8d0 */	u32 rsvd_8d0;
/* 0x8d4 */	u32 mc_min_length_nvenc_0;
/* 0x8d8 */	u32 rsvd_8d8[6];
/* 0x8f0 */	u32 mc_min_length_ppcs_0;
/* 0x8f4 */	u32 mc_min_length_ppcs_1;
/* 0x8f8 */	u32 mc_min_length_ptc_0;
/* 0x8fc */	u32 mc_min_length_sata_0;
/* 0x900 */	u32 rsvd_900[7];
/* 0x91c */	u32 mc_min_length_isp2_0;
/* 0x920 */	u32 mc_min_length_isp2_1;
/* 0x924 */	u32 rsvd_924;
/* 0x928 */	u32 mc_min_length_xusb_0;
/* 0x92c */	u32 mc_min_length_xusb_1;
/* 0x930 */	u32 mc_min_length_isp2b_0;
/* 0x934 */	u32 mc_min_length_isp2b_1;
/* 0x938 */	u32 rsvd_938;
/* 0x93c */	u32 mc_min_length_tsec_0;
/* 0x940 */	u32 mc_min_length_vic_0;
/* 0x944 */	u32 mc_min_length_vi2_0;
/* 0x948 */	u32 mc_untranslated_region_check_b01;
/* 0x94c */	u32 mc_min_length_axiap_0;
/* 0x950 */	u32 mc_min_length_a9avp_0;
/* 0x954 */	u32 rsvd_954;
/* 0x958 */	u32 mc_reserved_rsv_1;
/* 0x95c */	u32 mc_dvfs_pipe_select;
/* 0x960 */	u32 mc_ptsa_grant_decrement;
/* 0x964 */	u32 mc_iram_reg_ctrl;
/* 0x968 */	u32 mc_emem_arb_override_1;
/* 0x96c */	u32 rsvd_96c;
/* 0x970 */	u32 mc_client_hotreset_ctrl_1;
/* 0x974 */	u32 mc_client_hotreset_status_1;
/* 0x978 */	u32 mc_video_protect_bom_adr_hi;
/* 0x97c */	u32 rsvd_97c;
/* 0x980 */	u32 mc_iram_adr_hi;
/* 0x984 */	u32 mc_video_protect_gpu_override_0;
/* 0x988 */	u32 mc_video_protect_gpu_override_1;
/* 0x98c */	u32 rsvd_98c;
/* 0x990 */	u32 mc_emem_arb_stats_0;
/* 0x994 */	u32 mc_emem_arb_stats_1;
/* 0x998 */	u32 rsvd_998[2];
/* 0x9a0 */	u32 mc_mts_carveout_bom;
/* 0x9a4 */	u32 mc_mts_carveout_size_mb;
/* 0x9a8 */	u32 mc_mts_carveout_adr_hi;
/* 0x9ac */	u32 mc_mts_carveout_reg_ctrl;
/* 0x9b0 */	u32 mc_err_mts_status;
/* 0x9b4 */	u32 mc_err_mts_adr;
/* 0x9b8 */	u32 mc_smmu_ptc_flush_1;
/* 0x9bc */	u32 mc_security_cfg3;
/* 0x9c0 */	u32 rsvd_9c0[4];
/* 0x9d0 */	u32 mc_err_apb_asid_update_status;
/* 0x9d4 */	u32 mc_sec_carveout_adr_hi;
/* 0x9d8 */	u32 rsvd_9d8;
/* 0x9dc */	u32 mc_da_config0;
/* 0x9e0 */	u32 mc_smmu_asid_security_2;
/* 0x9e4 */	u32 mc_smmu_asid_security_3;
/* 0x9e8 */	u32 mc_smmu_asid_security_4;
/* 0x9ec */	u32 mc_smmu_asid_security_5;
/* 0x9f0 */	u32 mc_smmu_asid_security_6;
/* 0x9f4 */	u32 mc_smmu_asid_security_7;
/* 0x9f8 */	u32 rsvd_9f8[2];
/* 0xa00 */	u32 mc_gk_extra_snap_levels;
/* 0xa04 */	u32 mc_sd_extra_snap_levels;
/* 0xa08 */	u32 mc_isp_extra_snap_levels;
/* 0xa0c */	u32 rsvd_a0c;
/* 0xa10 */	u32 mc_aud_extra_snap_levels;
/* 0xa14 */	u32 mc_host_extra_snap_levels;
/* 0xa18 */	u32 mc_usbd_extra_snap_levels;
/* 0xa1c */	u32 mc_vicpc_extra_snap_levels;
/* 0xa20 */	u32 mc_stat_emc_filter_set0_adr_limit_upper;
/* 0xa24 */	u32 mc_stat_emc_filter_set1_adr_limit_upper;
/* 0xa28 */	u32 mc_stat_emc_filter_set0_virtual_adr_limit_upper;
/* 0xa2c */	u32 mc_stat_emc_filter_set1_virtual_adr_limit_upper;
/* 0xa30 */	u32 rsvd_a30[3];
/* 0xa3c */	u32 mc_jpg_extra_snap_levels;
/* 0xa40 */	u32 mc_gk2_extra_snap_levels;
/* 0xa44 */	u32 mc_sdm_extra_snap_levels;
/* 0xa48 */	u32 mc_hdapc_extra_snap_levels;
/* 0xa4c */	u32 mc_dfd_extra_snap_levels;
/* 0xa50 */	u32 rsvd_a50[14];
/* 0xa88 */	u32 mc_smmu_dc1_asid;
/* 0xa8c */	u32 rsvd_a8c[2];
/* 0xa94 */	u32 mc_smmu_sdmmc1a_asid;
/* 0xa98 */	u32 mc_smmu_sdmmc2a_asid;
/* 0xa9c */	u32 mc_smmu_sdmmc3a_asid;
/* 0xaa0 */	u32 mc_smmu_sdmmc4a_asid;
/* 0xaa4 */	u32 mc_smmu_isp2b_asid;
/* 0xaa8 */	u32 mc_smmu_gpu_asid;
/* 0xaac */	u32 mc_smmu_gpub_asid;
/* 0xab0 */	u32 mc_smmu_ppcs2_asid;
/* 0xab4 */	u32 mc_smmu_nvdec_asid;
/* 0xab8 */	u32 mc_smmu_ape_asid;
/* 0xabc */	u32 mc_smmu_se_asid;
/* 0xac0 */	u32 mc_smmu_nvjpg_asid;
/* 0xac4 */	u32 mc_smmu_hc1_asid;
/* 0xac8 */	u32 mc_smmu_se1_asid;
/* 0xacc */	u32 mc_smmu_axiap_asid;
/* 0xad0 */	u32 mc_smmu_etr_asid;
/* 0xad4 */	u32 mc_smmu_tsecb_asid;
/* 0xad8 */	u32 mc_smmu_tsec1_asid;
/* 0xadc */	u32 mc_smmu_tsecb1_asid;
/* 0xae0 */	u32 mc_smmu_nvdec1_asid;
/* 0xae4 */	u32 rsvd_ae4[8];
/* 0xb04 */	u32 mc_min_length_gpu_0;
/* 0xb08 */	u32 rsvd_b08[2];
/* 0xb10 */	u32 mc_min_length_sdmmca_0;
/* 0xb14 */	u32 mc_min_length_sdmmcaa_0;
/* 0xb18 */	u32 mc_min_length_sdmmc_0;
/* 0xb1c */	u32 mc_min_length_sdmmcab_0;
/* 0xb20 */	u32 mc_min_length_dc_3;
/* 0xb24 */	u32 rsvd_b24[3];
/* 0xb30 */	u32 mc_min_length_nvdec_0;
/* 0xb34 */	u32 mc_min_length_ape_0;
/* 0xb38 */	u32 mc_min_length_se_0;
/* 0xb3c */	u32 mc_min_length_nvjpg_0;
/* 0xb40 */	u32 mc_min_length_gpu2_0;
/* 0xb44 */	u32 mc_min_length_etr_0;
/* 0xb48 */	u32 mc_min_length_tsecb_0;
/* 0xb4c */	u32 rsvd_b4c[13];
/* 0xb80 */	u32 mc_emem_arb_niso_throttle_mask_1;
/* 0xb84 */	u32 mc_emem_arb_hysteresis_4;
/* 0xb88 */	u32 mc_stat_emc_filter_set0_client_4;
/* 0xb8c */	u32 mc_stat_emc_filter_set1_client_4;
/* 0xb90 */	u32 rsvd_b90;
/* 0xb94 */	u32 mc_emem_arb_isochronous_4;
/* 0xb98 */	u32 mc_smmu_translation_enable_4;
/* 0xb9c */	u32 mc_smmu_client_config4;
/* 0xba0 */	u32 rsvd_ba0[4];
/* 0xbb0 */	u32 mc_emem_arb_dhysteresis_0;
/* 0xbb4 */	u32 mc_emem_arb_dhysteresis_1;
/* 0xbb8 */	u32 mc_emem_arb_dhysteresis_2;
/* 0xbbc */	u32 mc_emem_arb_dhysteresis_3;
/* 0xbc0 */	u32 mc_emem_arb_dhysteresis_4;
/* 0xbc4 */	u32 rsvd_bc4[2];
/* 0xbcc */	u32 mc_emem_arb_dhyst_ctrl;
/* 0xbd0 */	u32 mc_emem_arb_dhyst_timeout_util_0;
/* 0xbd4 */	u32 mc_emem_arb_dhyst_timeout_util_1;
/* 0xbd8 */	u32 mc_emem_arb_dhyst_timeout_util_2;
/* 0xbdc */	u32 mc_emem_arb_dhyst_timeout_util_3;
/* 0xbe0 */	u32 mc_emem_arb_dhyst_timeout_util_4;
/* 0xbe4 */	u32 mc_emem_arb_dhyst_timeout_util_5;
/* 0xbe8 */	u32 mc_emem_arb_dhyst_timeout_util_6;
/* 0xbec */	u32 mc_emem_arb_dhyst_timeout_util_7;
/* 0xbf0 */	u32 rsvd_bf0[4];
/* 0xc00 */	u32 mc_err_generalized_carveout_status;
/* 0xc04 */	u32 mc_err_generalized_carveout_adr;
/* 0xc08 */	u32 mc_security_carveout1_cfg0;
/* 0xc0c */	u32 mc_security_carveout1_bom;
/* 0xc10 */	u32 mc_security_carveout1_bom_hi;
/* 0xc14 */	u32 mc_security_carveout1_size_128kb;
/* 0xc18 */	u32 mc_security_carveout1_client_access0;
/* 0xc1c */	u32 mc_security_carveout1_client_access1;
/* 0xc20 */	u32 mc_security_carveout1_client_access2;
/* 0xc24 */	u32 mc_security_carveout1_client_access3;
/* 0xc28 */	u32 mc_security_carveout1_client_access4;
/* 0xc2c */	u32 mc_security_carveout1_client_force_internal_access0;
/* 0xc30 */	u32 mc_security_carveout1_client_force_internal_access1;
/* 0xc34 */	u32 mc_security_carveout1_client_force_internal_access2;
/* 0xc38 */	u32 mc_security_carveout1_client_force_internal_access3;
/* 0xc3c */	u32 mc_security_carveout1_client_force_internal_access4;
/* 0xc40 */	u32 rsvd_c40[6];
/* 0xc58 */	u32 mc_security_carveout2_cfg0;
/* 0xc5c */	u32 mc_security_carveout2_bom;
/* 0xc60 */	u32 mc_security_carveout2_bom_hi;
/* 0xc64 */	u32 mc_security_carveout2_size_128kb;
/* 0xc68 */	u32 mc_security_carveout2_client_access0;
/* 0xc6c */	u32 mc_security_carveout2_client_access1;
/* 0xc70 */	u32 mc_security_carveout2_client_access2;
/* 0xc74 */	u32 mc_security_carveout2_client_access3;
/* 0xc78 */	u32 mc_security_carveout2_client_access4;
/* 0xc7c */	u32 mc_security_carveout2_client_force_internal_access0;
/* 0xc80 */	u32 mc_security_carveout2_client_force_internal_access1;
/* 0xc84 */	u32 mc_security_carveout2_client_force_internal_access2;
/* 0xc88 */	u32 mc_security_carveout2_client_force_internal_access3;
/* 0xc8c */	u32 mc_security_carveout2_client_force_internal_access4;
/* 0xc90 */	u32 rsvd_c90[6];
/* 0xca8 */	u32 mc_security_carveout3_cfg0;
/* 0xcac */	u32 mc_security_carveout3_bom;
/* 0xcb0 */	u32 mc_security_carveout3_bom_hi;
/* 0xcb4 */	u32 mc_security_carveout3_size_128kb;
/* 0xcb8 */	u32 mc_security_carveout3_client_access0;
/* 0xcbc */	u32 mc_security_carveout3_client_access1;
/* 0xcc0 */	u32 mc_security_carveout3_client_access2;
/* 0xcc4 */	u32 mc_security_carveout3_client_access3;
/* 0xcc8 */	u32 mc_security_carveout3_client_access4;
/* 0xccc */	u32 mc_security_carveout3_client_force_internal_access0;
/* 0xcd0 */	u32 mc_security_carveout3_client_force_internal_access1;
/* 0xcd4 */	u32 mc_security_carveout3_client_force_internal_access2;
/* 0xcd8 */	u32 mc_security_carveout3_client_force_internal_access3;
/* 0xcdc */	u32 mc_security_carveout3_client_force_internal_access4;
/* 0xce0 */	u32 rsvd_ce0[6];
/* 0xcf8 */	u32 mc_security_carveout4_cfg0;
/* 0xcfc */	u32 mc_security_carveout4_bom;
/* 0xd00 */	u32 mc_security_carveout4_bom_hi;
/* 0xd04 */	u32 mc_security_carveout4_size_128kb;
/* 0xd08 */	u32 mc_security_carveout4_client_access0;
/* 0xd0c */	u32 mc_security_carveout4_client_access1;
/* 0xd10 */	u32 mc_security_carveout4_client_access2;
/* 0xd14 */	u32 mc_security_carveout4_client_access3;
/* 0xd18 */	u32 mc_security_carveout4_client_access4;
/* 0xd1c */	u32 mc_security_carveout4_client_force_internal_access0;
/* 0xd20 */	u32 mc_security_carveout4_client_force_internal_access1;
/* 0xd24 */	u32 mc_security_carveout4_client_force_internal_access2;
/* 0xd28 */	u32 mc_security_carveout4_client_force_internal_access3;
/* 0xd2c */	u32 mc_security_carveout4_client_force_internal_access4;
/* 0xd30 */	u32 rsvd_d30[6];
/* 0xd48 */	u32 mc_security_carveout5_cfg0;
/* 0xd4c */	u32 mc_security_carveout5_bom;
/* 0xd50 */	u32 mc_security_carveout5_bom_hi;
/* 0xd54 */	u32 mc_security_carveout5_size_128kb;
/* 0xd58 */	u32 mc_security_carveout5_client_access0;
/* 0xd5c */	u32 mc_security_carveout5_client_access1;
/* 0xd60 */	u32 mc_security_carveout5_client_access2;
/* 0xd64 */	u32 mc_security_carveout5_client_access3;
/* 0xd68 */	u32 mc_security_carveout5_client_access4;
/* 0xd6c */	u32 mc_security_carveout5_client_force_internal_access0;
/* 0xd70 */	u32 mc_security_carveout5_client_force_internal_access1;
/* 0xd74 */	u32 mc_security_carveout5_client_force_internal_access2;
/* 0xd78 */	u32 mc_security_carveout5_client_force_internal_access3;
/* 0xd7c */	u32 mc_security_carveout5_client_force_internal_access4;
/* 0xd80 */	u32 rsvd_d80[20];
/* 0xdd0 */	u32 mc_pcfifo_client_config0;
/* 0xdd4 */	u32 mc_pcfifo_client_config1;
/* 0xdd8 */	u32 mc_pcfifo_client_config2;
/* 0xddc */	u32 mc_pcfifo_client_config3;
/* 0xde0 */	u32 mc_pcfifo_client_config4;
} mc_regs_t210_t;

#endif
